<?php
/*
=====================================================
 DataLife Engine - by SoftNews Media Group 
-----------------------------------------------------

-----------------------------------------------------
 Copyright (c) 2004,2011 SoftNews Media Group
=====================================================
 Данный код защищен авторскими правами
=====================================================
 Файл: mysql.php
-----------------------------------------------------
 Назначение: Класс для работы с базой данных
=====================================================
*/
if ( extension_loaded('mysqli') )
{
	include_once( ROOT_DIR."/classes/mysqli.class.php" );
}
else
{
	include_once( ROOT_DIR."/classes/mysql.class.php" );
}

?>